# Планеты вращаются вокруг звезд по эллиптическим орбитам.
# Назовем самой далекой планетой ту, орбита которой имеет
# самую большую площадь. Напишите функцию
# find_farthest_orbit(list_of_orbits), которая среди списка орбит
# планет найдет ту, по которой вращается самая далекая
# планета. Круговые орбиты не учитывайте: вы знаете, что у
# вашей звезды таких планет нет, зато искусственные спутники
# были были запущены на круговые орбиты. Результатом
# функции должен быть кортеж, содержащий длины полуосей
# эллипса орбиты самой далекой планеты. Каждая орбита
# представляет из себя кортеж из пары чисел - полуосей ее
# эллипса. Площадь эллипса вычисляется по формуле S = pi*a*b,
# где a и b - длины полуосей эллипса. При решении задачи
# используйте списочные выражения. Подсказка: проще всего
# будет найти эллипс в два шага: сначала вычислить самую
# большую площадь эллипса, а затем найти и сам эллипс,
# имеющий такую площадь. Гарантируется, что самая далекая
# планета ровно одна
'''
# Ввод:
orbits = [(1, 3), (2.5, 10), (7, 2), (6, 6), (4, 3)]


# Вывод:
# 2.5 10
from math import pi
find_farthest_orbit = list(map(lambda x : pi*x[0]*x[1], orbits))

print(*find_farthest_orbit)#(orbits))
'''

orbits = [(1, 3), (2.5, 10), (7, 2), (6, 6), (4, 3)]
def orbita(array):
    maxi_orbit = 0
    for i in range(len(array)):
        for j in range(0,2):
            if j == 0:
                x = array[i][j]
            y = array[i][j]
        if x != y:
            S = lambda x,y: 3.14 * x * y
            if maxi_orbit < S(x,y):
                maxi_orbit = S(x,y) 
                orb = i  
    return orb
print(orbits[orbita(orbits)])

